export const siteConfig = {
  herName: 'အာပူတူးလေး',
  yourName: 'ကိုကို',
  birthdayDate: 'September 11, 2026',
  heroMessage: 'နှစ်စဉ်နှစ်တိုင်း ကိုကို့ ကလေးလေး အဖြစ် ရှိနေပေးလို့, ကျေးဇူးအများကြီး တင်ပါတယ်။',
}

export const loveReasons = [
  { icon: '😠', title: 'Pouting Face', text: 'စိတ်ကောက်ပြီး မျက်နှာဆူပုတ်နေရင် ဘလိုချစ်ဖို့ကောင်းနေမှန်း မသိတာမျိုး' },
  { icon: '😂', title: 'Laugh', text: 'တစ်ခါတစ်ခါ ယောက်ျားဆန်တဲ့ ရယ်သံလေးကလဲ ကို့အတွတ် ဆွဲဆောင်မှုရှိနေတာမျိုးလေး' },
  { icon: '🌷', title: 'Kindness', text: 'စိတ်ရင်းကောင်းပြီး လူကြီးမိဘအပေါ် သိတတ်တဲ့ စိတ်ထားလေးကိုလဲ သဘောကျတယ်' },
  { icon: '🐻', title: 'Cute Side', text: 'ရန်ဖြစ်တဲ့အချိန်လဲ ချစ်ဖို့ကောင်းတယ်၊ တည့်နေတဲ့ချိန်လဲ ချစ်ဖို့ကောင်းတယ်၊ ဘယ်ချိန်ဖြစ်ဖြစ် ချစ်ဖို့ကောင်းနေတာ' },
  { icon: '✨', title: 'Loyalty', text: 'ဖောက်ပြန်တတ်တဲ့ခေတ်ကြီးထဲမှာ ဘယ်ချိန်ပဲဖြစ်ဖြစ် ကို့ကလေးလေး ဖောက်ပြန်မှာမဟုတ်ဘူးဆိုတဲ့ လုံခြုံတဲ့ခံစားချက်လေးကိုလဲ သဘောကျတယ်' },
  { icon: '❤️', title: 'Just You', text: 'ဘလိုပဲဖြစ်ဖြစ် ချစ်ဖြစ်နေလို့ကို ချစ်နေရတာ' },
]

export const timeline = [
  { date: 'The Beginning', title: 'First Date', text: 'ပထမဆုံး ၂ ယောက်အတူတူ လည်လည်ထွတ်ခဲ့တုန်း အချိန်လေးပေါ့ 😎 (ဘယ်တော့မှ မေ့ရမှာမဟုတ်တဲ့ နေ့ရက်လေး 🥰)', image: '/photos/firstmeet.jpg' },
  { date: 'A Favorite Day', title: 'Special Memory', text: 'ခနခန အမြဲအတူတူသွားဖြစ်တဲ့ ရန်ကုန်က တစ်နေရာပေါ့ ကွယ် ❤️', image: '/photos/1771993869739 (2) (1).png' },
  { date: 'Us Being Us', title: 'A Happy Day', text: 'အတူတူရှိနေတဲ့ အချိန်တိုင်းကတော့ မေ့မပျောက်နိုင်တဲ့ နေ့ရက်တွေပဲပေါ့ 🤗', image: '/photos/bp-2.png' },
  { date: '11 Sep 2026', title: 'Chit\'s Birthday', text: 'တစ်နှစ်ကုန်သွားလဲ နောက်နှစ်မှာ ကြည်နူးဖွယ်ကောင်းမဲ့ memories အသစ်တွေ အတူတူဖန်တီးဖို့ အသင့်ရှိနေပါပြီနော် ❤️', image: '/photos/IMG_20260910_201942_086 (1).jpg' },
]

export const gallery = [
  { src: '/photos/20260910_171058.jpg', caption: 'မြန်မာဝတ်စုံလေးနဲ့လဲ ချစ်ဖို့ကောင်းနေတဲ့ ကို့ကလေးလေးပေါ့ 😘' },
  { src: '/photos/tiktok.mp4', caption: '  ကို့ရဲ့ တစ်ဦးတည်းသော tiktoker လေး' },
  { src: '/photos/bagan1.jpg', caption: 'နန်းဆန်နေသူလေးပေါ့ 😍' },
  { src: '/photos/20260910_174009.jpg', caption: 'ငယ်ငယ်တုန်းက ချစ်ဖို့ကောင်းသလောက် ကြီးလာမှ ဝလာတာ 😁' },
  { src: '/photos/bp-0.jpg', caption: 'နေရာတကာ ဆရာလုပ်ချင်တဲ့ ဆရာမလေးပေါ့ 😍' },
  { src: '/photos/IMG_20241122_223542_166.jpg', caption: 'တစ်ခါတစ်လေလဲ တစ်ခုခု လိုနေသလိုပဲနော် 😮‍💨' },
]

export const letters = [
  {
    icon: '☀️',
    title: "Open when you're happy",
    body: "ကို့ကလေးလေးပျော်ရင် ကိုကိုလဲ ပျော်တာပေါ့ကွယ်။ ဘာတွေဖြစ်ပြီး ပျော်နေတာလဲ ဆိုတာ ကို့စီ ပြန်ပြောပြပါအုံး၊ နားထောင်ချင်လို့။ 😘",
  },
  {
    icon: '🌧️',
    title: "Open when you're sad",
    body: "ဘာလို့ စိတ်မကောင်းဖြစ်နေတာလဲ ကလေးလေးရဲ့၊ လာလာ ကိုကို့ chatbox မှာ ချစ်ကို စိတ်မကောင်းဖြစ်အောင်လုပ်တဲ့ လူတွေအကြောင်း အတင်းတုတ်ကြမယ်။",
  },
  {
    icon: '🥺',
    title: 'Open when you miss me',
    body: "ကိုကိုလဲ ကို့ကလေးလေးကို အကြီးကြီး လွမ်းနေတာပေါ့ကွယ်။ တစ်ရက်ပြီးတစ်ရက် ပြန်တွေ့ရတော့မဲ့ အချိန်တွေက တဖြည်းဖြည်းချင်း နီးလာပါပြီနော်၊ အားတင်းထား။ အာဂျား အာဂျား....",
  },
  {
    icon: '🌙',
    title: "Open when you can't sleep",
    body: "ဘာတွေတွေးပြီး အိပ်မပျော်ဖြစ်နေတာတုန်း ကလေးလေးရဲ့၊ အိပ်လို့မရရင် ဘာလုပ်ရမလဲဆိုတာ သိတယ်မလား။ ကိုကို ပြောထားတယ်လေ၊ မေ့နေရင် ထပ်ပြောမယ်, အိပ်မပျော်တိုင်း ကို့စီ အချိန်မရွေးဖုန်းဆက်လို့ရတယ်နော်၊ အာပူတူးလေး...❤️",
  },
  {
    icon: '🫶',
    title: 'Open when you need love',
    body: "အမလေးတော့၊ အချစ်တွေလိုနေတယ်လို့ ခံစားနေရတုန်းလား။ ဒီလောက်ထိ အကြီးကြီးချစ်ပေးနေတာကိုနော် 🤨။ ထပ်တိုးပေးရအုံးမယ်ဆိုရင်တော့ တစ်ကမ္ဘာလုံး ကို့အချစ်တွေနဲ့ ပြည့်ကုန်တော့မှာပဲ 😂",
  },
  {
    icon: '🧧',
    title: 'Open when you need pocketmoney',
    body: "ဒါကိုမြင်တာနဲ့ တန်းဖွင့်မယ်ဆိုတာ သိနေတယ်နော် 😒။ လာလာ ဒီစာကို scrrenshot ပြပြီး ကို့စီမှာ လာထုတ်။",
  },
]
